MakerLabMe/STM32_Arduino_Cores/boards.txt

arduino_due_x_dbg.name=Arduino Due (Programming Port)
arduino_due_x_dbg.vid.0=0x2341
arduino_due_x_dbg.pid.1=0x003d
arduino_due_x_dbg.upload.tool=bossac
arduino_due_x_dbg.upload.protocol=sam-ba
arduino_due_x_dbg.upload.maximum_size=524288
arduino_due_x_dbg.upload.use_1200bps_touch=true
arduino_due_x_dbg.upload.wait_for_upload_port=false
arduino_due_x_dbg.upload.native_usb=false
arduino_due_x_dbg.build.mcu=cortex-m3
arduino_due_x_dbg.build.f_cpu=84000000L
arduino_due_x_dbg.build.usb_product="Arduino Due"
arduino_due_x_dbg.build.board=SAM_DUE
arduino_due_x_dbg.build.core=arduino
arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x_dbg.build.variant=arduino_due_x
arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x_dbg.build.vid=0x2341
arduino_due_x_dbg.build.pid=0x003e

STduino_due_x.name=STduino Due (Native USB Port)
STduino_due_x.vid.0=0x2341
STduino_due_x.pid.0=0x003e
STduino_due_x.upload.tool=sloadhost-stm32
STduino_due_x.upload.protocol=
STduino_due_x.upload.maximum_size=524288
STduino_due_x.upload.use_1200bps_touch=false
STduino_due_x.upload.wait_for_upload_port=false
STduino_due_x.upload.native_usb=false
STduino_due_x.build.mcu=cortex-m3
STduino_due_x.build.f_cpu=72000000L
STduino_due_x.build.usb_product="STduino Due"
STduino_due_x.build.board=STM32_DUE
STduino_due_x.build.core=arduino
STduino_due_x.build.extra_flags=-DSTM32F10X_HD -mthumb {build.usb_flags}
STduino_due_x.build.ldscript=linker_scripts/gcc/flash.ld
STduino_due_x.build.variant=stduino_due_x
STduino_due_x.build.variant_system_lib=libstm_stm32f10x_hd_gcc_rel.a
STduino_due_x.build.vid=0x2341
STduino_due_x.build.pid=0x003e

